{
  "results": [
    {
      "id": "001",
      "text": "What is programming",
      "content": "<h2><strong>What is ERP Babes?</strong></h2>The acronym ERP stands for Enterprise Resource Planning. In early 90’s when Industries were expanding, then there was a need of a system or structure that will centralize business Information i.e. bring all the Industrial information at a single place. As the name suggests <strong>Enterprise</strong> needs a <strong>planning</strong> to manage all its <strong>resource</strong> i.e. Human Resource, Manufacturing Resource, Production Resource, Capital Resource, etc. In Business world, it refers to the systems &amp; software packages used by organizations/industries to manage daily business activities, such as procurement, manufacturing, delivery, accounting, project management and human resource management.<h2><strong>Why we need ERP?</strong></h2>Let us suppose, we don’t have any ERP system. And I am the owner of Tea shops in China. I am planning to expand my tea shop chains across the globe. Now, I have to make a directory of every employee, every sale, every purchase of raw items, every rented shops and etc. Now, if I want to check data for every place, I have to go there physically and check. If each data is maintained in an Excel sheet, then also I have to check them individually. That is the wastage of my time and money. And we have to save both. Thus, the requirement was there to build something that will bring all the data at a single place and further can be verified and using them Business planning’s can be made.<img class='alignnone wp-image-641 size-full' title='What is ERP' src='https://gocoding.org/wp-content/uploads/2017/12/ERP.png' alt='What is ERP'/><h2><strong>The Business Value of ERP:</strong></h2><ul> <li><strong>Improves business insights using real time information based reports</strong></li> <li><strong>Lowers operational cost using streamlined business process</strong></li> <li><strong>Enhances collaboration using shared data of users</strong></li> <li><strong>Improves Efficiency using common User Experience across all business process</strong></li> <li><strong>Consistent Infrastructure by bringing everything under same hood</strong></li> <li>&lt;strong'&gt;Reduces Risk using data Integrity</li> <li><strong>Lowers Management &amp; Operational Cost using uniform &amp; Integrated systems</strong></li></ul><h2><strong>Why ERP Suite:</strong></h2>An ERP Suite always wins over a single point solution as it integrates the entire business module and keeps finance and human resource under control.<h2><strong class='post'>ERP Solutions in Market:</strong></h2><ul class='post'> <li><a class='link'> SAP </a></li> <li>FIS Global</li> <li><a class='link' href='https://www.oracle.com/in/index.html'>Oracle</a></li> <li>Fiserv</li> <li>Intuit Inc.</li> <li>Cerner Corporation</li> <li>Microsoft</li> <li>Ericsson</li> <li>Infor</li> <li>McKesson</li></ul><h2><strong>Basic Modules of ERP:</strong></h2><ul> <li>Human Resource</li> <li>Inventory</li> <li>Sales &amp; Marketing</li> <li>Purchase</li> <li>Finance &amp; Accounting</li> <li>Customer Relationship Management(CRM)</li> <li>Engineering/ Production</li> <li>Supply Chain Management (SCM)</li></ul><h2><strong class='post'>Future of ERP:</strong></h2>Every year technologies evolves and with that the requirement of Vendors and client too. To ease their work process, ERP has to evolve too. As of now, every ERP system is focussing upon their cloud solutions. And sooner the dependency upon on-premise ERP systems will end.",
      "status": "inactive"
    }
  ]
}
