{
  "results": [
    {
      "id": "001",
      "text": "What is ERP",
      "content": "<h2><strong>What is ERP Babes?</strong></h2>The acronym ERP stands for Enterprise Resource Planning. In early 90’s when Industries were expanding, then there was a need of a system or structure that will centralize business Information i.e. bring all the Industrial information at a single place. As the name suggests <strong>Enterprise</strong> needs a <strong>planning</strong> to manage all its <strong>resource</strong> i.e. Human Resource, Manufacturing Resource, Production Resource, Capital Resource, etc. In Business world, it refers to the systems &amp; software packages used by organizations/industries to manage daily business activities, such as procurement, manufacturing, delivery, accounting, project management and human resource management.<h2><strong>Why we need ERP?</strong></h2>Let us suppose, we don’t have any ERP system. And I am the owner of Tea shops in China. I am planning to expand my tea shop chains across the globe. Now, I have to make a directory of every employee, every sale, every purchase of raw items, every rented shops and etc. Now, if I want to check data for every place, I have to go there physically and check. If each data is maintained in an Excel sheet, then also I have to check them individually. That is the wastage of my time and money. And we have to save both. Thus, the requirement was there to build something that will bring all the data at a single place and further can be verified and using them Business planning’s can be made.<img class='alignnone wp-image-641 size-full' title='What is ERP' src='https://gocoding.org/wp-content/uploads/2017/12/ERP.png' alt='What is ERP'/><h2><strong>The Business Value of ERP:</strong></h2><ul> <li><strong>Improves business insights using real time information based reports</strong></li> <li><strong>Lowers operational cost using streamlined business process</strong></li> <li><strong>Enhances collaboration using shared data of users</strong></li> <li><strong>Improves Efficiency using common User Experience across all business process</strong></li> <li><strong>Consistent Infrastructure by bringing everything under same hood</strong></li> <li>&lt;strong'&gt;Reduces Risk using data Integrity</li> <li><strong>Lowers Management &amp; Operational Cost using uniform &amp; Integrated systems</strong></li></ul><h2><strong>Why ERP Suite:</strong></h2>An ERP Suite always wins over a single point solution as it integrates the entire business module and keeps finance and human resource under control.<h2><strong class='post'>ERP Solutions in Market:</strong></h2><ul class='post'> <li><a class='link'> SAP </a></li> <li>FIS Global</li> <li><a class='link' href='https://www.oracle.com/in/index.html'>Oracle</a></li> <li>Fiserv</li> <li>Intuit Inc.</li> <li>Cerner Corporation</li> <li>Microsoft</li> <li>Ericsson</li> <li>Infor</li> <li>McKesson</li></ul><h2><strong>Basic Modules of ERP:</strong></h2><ul> <li>Human Resource</li> <li>Inventory</li> <li>Sales &amp; Marketing</li> <li>Purchase</li> <li>Finance &amp; Accounting</li> <li>Customer Relationship Management(CRM)</li> <li>Engineering/ Production</li> <li>Supply Chain Management (SCM)</li></ul><h2><strong class='post'>Future of ERP:</strong></h2>Every year technologies evolves and with that the requirement of Vendors and client too. To ease their work process, ERP has to evolve too. As of now, every ERP system is focussing upon their cloud solutions. And sooner the dependency upon on-premise ERP systems will end.",
      "status": "inactive"
    },
    {
      "id": "002",
      "text": "What is SAP",
      "content": "<strong>What is SAP Babes?</strong>SAP is software as well as a Company which provides ERP solution.The initialism SAP stands for Systems, Applications &amp; Products in Data Processing.It is pronounced as S-A-P. (In German language, sap means idiot. That's why they forbid it to call sap and rather call it S.A.P)The SAP software is built on ABAP Programming language which was developed by SAP itself.The Headquarter of SAP is in Walldorf, Germany.The current version of SAP software is called SAP-ERP 6.0 which is an upgraded version of SAP-R/3, here R stands for ‘Real Time Processing’ and 3 stands for ‘3 tier’ platform i.e.1) Database2) Application server3) Client (GUI)[caption id='attachment_732' align='alignnone' width='740']<img class='wp-image-732 size-full' src='https://gocoding.org/wp-content/uploads/2018/03/NetWeaver-Stack.png' alt='what is sap'/> Basic Architecture of NetWeaver Stack[/caption]SAP-ECC i.e. <a href='https://en.wikipedia.org/wiki/SAP_ERP'>ERP</a> Central Component is the core component of the SAP's Business Suite which consists of:<ul> <li>ERP</li> <li>CRM</li> <li>SCM</li> <li>S/4 HANA</li></ul><strong>What are Modules in SAP?</strong>Initially, SAP was single software for all operations but with time it evolved and started focusing upon different processes.To lower the load on single software and to divide the work on the basis of field, it came in different modules. SAP has following major Modules:<ul> <li><strong>MM</strong>: Material Management</li> <li><strong>PP</strong>:Production Planning</li> <li><strong>SD:</strong>Sales and Distribution</li> <li><strong>HR:</strong>Human Resources or <strong>HCM: </strong>Human Capital Management</li> <li><strong>QM:</strong>Quality Management</li> <li><strong>FICO:</strong>Financial Accounting and Controlling</li></ul><h1><strong>What is SAP-NetWeaver?</strong></h1>SAP-NetWeaver is a technology by SAP which is developed primarily using <a href='https://gocoding.org/what-is-an-abap/'>ABAP</a>. It is a solution stack of SAP’s technology products.In simpler words, it is a breadboard on which other hardware’s (here SAP-Modules/ Non-SAP modules) can be attached.<a href='https://gocoding.org/sap-saas/'><strong>What is SaaS?</strong></a>SaaS stands for software-as-a-service.It is a way of delivering applications/Apps over the web/internet.Customers can access SaaS Apps right from any Web browser via any of their devices (Mobile, PC, tablet). It means there is no requirement to buy, install, maintain, or update any Hardware or Software.The SaaS provider will take care of every next required operations– and the customer will always have the latest version of the application.Following are the major SaaS products:• SAP-SuccessFactors HR Solutions• SAP-Hybris Cloud for Customer• Ariba Network: Sourcing, Procurement, &amp; Finance• Concur: Travel &amp; Expense Management",
      "status": "inactive"
    },
    {
      "id": "003",
      "text": "What is Netweaver Gateway",
      "content": "<h1><strong>What is SAP NetWeaver Babes?</strong></h1>SAP NetWeaver is a technology by <a href='https://gocoding.org/what-is-sap/'>SAP</a> which is developed primarily using <a href='https://gocoding.org/what-is-an-abap/'>ABAP</a>. It is a solution stack of SAP’s technology products. In simpler words, it is a breadboard on which other hardware’s (here SAP Modules/ Non SAP modules) can be attached.[caption id='attachment_732' align='alignnone' width='740']<img class='wp-image-732 size-full' title='SAP NetWeaver Stack' src='https://gocoding.org/wp-content/uploads/2018/03/NetWeaver-Stack.png' alt='SAP NetWeaver Stack' /> Basic Architecture of SAP NetWeaver Stack[/caption]Following are the components of SAP NetWeaver (NW):<ul> <li>SAP NW <a href='https://en.wikipedia.org/wiki/SAP_Web_Application_Server'>Application Server</a></li> <li>SAP NW <a href='https://en.wikipedia.org/wiki/SAP_Business_Information_Warehouse'>Business Intelligence</a></li> <li>SAP NW <a href='https://en.wikipedia.org/w/index.php?title=SAP_NetWeaver_Composition_Environment&amp;action=edit&amp;redlink=1'>Composition Environment (CE)</a></li> <li>SAP NW <a href='https://en.wikipedia.org/wiki/SAP_Enterprise_Portal'>Enterprise Portal (EP)</a></li> <li>SAP NW <a href='https://en.wikipedia.org/wiki/SAP_NetWeaver_Identity_Management'>Identity Management (IDM)</a></li> <li>SAP NW <a href='https://en.wikipedia.org/wiki/SAP_Master_Data_Management'>Master Data Management (MDM)</a></li> <li>SAP NW<a href='https://en.wikipedia.org/w/index.php?title=SAP_NetWeaver_Mobile&amp;action=edit&amp;redlink=1'> Mobile</a></li> <li>SAP NW <a href='https://en.wikipedia.org/wiki/SAP_XI'>Process Integration (PI)</a></li></ul><h1><strong>What is a SAP NetWeaver Application Server?</strong></h1>The SAP NetWeaver Application Server is just like the nervous system of our body. It provides the <a href='https://en.wikipedia.org/wiki/Runtime_environment'>runtime environment</a> to the SAP applications. All of the SAP Business Suite e.g. ERP, CRM runs on SAP NetWeaver Application Server. Following layers will make it clearer:<table><tbody><tr><td width='308'><strong>Presentation layer </strong></td><td width='308'>UI5, Web Dynpro</td></tr><tr><td width='308'><strong>Business layer (Application Layer)</strong></td><td width='308'><a href='https://gocoding.org/what-is-an-abap/'>ABAP</a>/ Java</td></tr><tr><td width='308'><strong>Integration layer </strong></td><td width='308'>SAP PI (Product Integration)</td></tr><tr><td width='308'><strong>Connectivity layer </strong></td><td width='308'>HTTP/HTTPS/SOAP/REST</td></tr><tr><td width='308'><strong>Persistence layer (Database Layer)</strong></td><td width='308'>Open SQL</td></tr></tbody></table>&nbsp;<h1><strong>What is a SAP NetWeaver Gateway?</strong></h1>SAP NetWeaver Gateway helps Application tier to communicate with Presentation Layer. In three-tier architecture, the Presentation layer is GUI (UI5 nowadays) and Database Layer is HANA Database (nowadays).SAP Gateways is the middle or Application tier. This Application layer is essential for communication between the UI and the backend.The main motto to use multi-tier architecture was to implement a data processing system that will add a valuable level of modularity and flexibility to the system by developing and maintaining each tier individually. OData is used to exchange data.<h1><strong>What is an OData?</strong></h1>OData which stands for Open Data Protocol is an open source to exchange data over the Internet. It was built by Microsoft.OData protocol is HTTP based, due to which any programming language with HTTP stack can consume OData services. The output is in the form of JSON or ATOM (i.e. XML).<h1><strong>Why SAP NetWeaver?</strong></h1><ul> <li>Increases Efficiency of business processes by providing role based access</li> <li>Provides dynamic and cost effective communication between different teams</li> <li>Multichannel Enterprise access via different devices</li> <li>Provides development environment using both ABAP and non ABAP languages and connects them all using REST &amp; SOAP APIs.</li></ul>",
      "status": "inactive"
    },
    {
      "id": "004",
      "text": "What is ABAP",
      "content": "<h1><strong>What is ABAP Babes?</strong></h1>A general interview question: 'What is ABAP?'. ABAP stands for Advanced Business Application Programming. It is a 4th Generation (because it is domain specific language) programming language developed by SAP. The ABAP kernel is implemented in C++.ABAP is a hybrid programming language that supports both a procedural and an object-oriented programming model.All ABAP programs also called Reports reside inside SAP database. In the database all ABAP code exists in two forms: <strong>source code</strong>, which can be viewed and edited with the ABAP Workbench tools; and <strong>generated code</strong>, a binary representation somewhat comparable with <a href='https://en.wikipedia.org/wiki/Java_(programming_language)'>Java</a> byte code.When you write a code in ABAP editor, it is saved in two files. One is the exact what you have written and other is the code converted in Binary format. The Binary code is the one actually executed by the computer.ABAP has both compiler and Interpreter. Firstly, the ABAP compiler translates an ABAP program it into an intermediate language called an ABAP load. Then the ABAP virtual machine, an interpreter for ABAP loads (i.e. it can execute ABAP loads) comes into the picture. SAP has two tables to store these files, ABAP reports in D010S table and ABAP Loads in D010L table.<h1><strong>ABAP on Application Server ABAP</strong></h1>ABAP is the programming interface of Application Server ABAP (AS ABAP) in SAP NetWeaver. A prerequisite to use the ABAP programming language is to install an Application Server ABAP. The components of an Application Server ABAP can be organized in the layers (presentation, application, and database) of three-tier client-server architecture in accordance with their tasks.<ul> <li>The presentation layer represents the user interface of an AS ABAP (SAP GUI or Web browser)and it is distributed to the workstations of individual users.</li> <li>The application layeris implemented by utilizing one or more application servers. The application layer contains the ABAP runtime environment in which ABAP programs are executed.</li> <li>The database layerconsists of a database system in which the central dataset of an Application Server ABAP is saved.</li></ul><h1><strong>Programming Models</strong></h1>ABAP supports the following:<ul> <li>An object-oriented programming model based on classesand interfaces</li> <li>A procedural programming model based on function modulesand subroutines</li></ul>Both modules offer interoperability.<h1><strong>Types of ABAP programs</strong></h1>ABAP distinguishes two types of executable programs:<ul> <li><strong>Reports</strong> : Simple Programs which provides Input/output option to user</li> <li><strong>Module pools</strong>: Complex Programs which provides different screens for better user experience.</li></ul>&nbsp;The non-executable program types are:<ul> <li><strong>INCLUDE modules</strong> : It gets included automatically at generation time; it is often used to subdivide large programs</li> <li><strong>Subroutine pools</strong>: It contains ABAP subroutines (enclosed by FORM/ENDFORM statements and invoked via PERFORM).</li> <li><strong>Function groups</strong>: These are libraries of self-contained FMs (enclosed by FUNCTION/ENDFUNCTION and invoked via CALL FUNCTION)</li> <li><strong>Object classes</strong>: similar to Java Classes &amp;define a set of methods and attributes</li> <li><strong>Interfaces</strong>: It contain method definitions without implementations for which any class implementing the interface must provide explicit code.</li> <li><strong>Type pools</strong>: Type pools define collections of data types and constants.</li></ul>&nbsp;<h1>Development Environment</h1>There are two possible ways to develop in ABAP.<h2>ABAP Workbench</h2>The <strong>ABAP Workbench</strong> is part of the SAP ABAP system and is accessed via <a href='https://en.wikipedia.org/wiki/SAPgui'>SAPgui</a>. It contains different tools for editing programs. The most important of these are (transaction codes are shown in parentheses):<ul> <li><em>ABAP Editor</em>(SE38): It is used to write and edit reports, module pools, includes and subroutine pools</li> <li><em>ABAP Dictionary</em>(SE11): It is used to process database table</li> <li><em>Menu Painter</em>(SE41): It is used to design the user interface (e.g. menu bar &amp; standard toolbar)</li> <li><em>Screen Painter</em>(SE51): It is used to design screens and flow logic</li> <li><em>Function Builder</em>(SE37): for function modules</li> <li><em>Class Builder</em>(SE24): It is used to construct ABAP Objects classes and interfaces</li></ul>The <em>Object Navigator</em> (SE80) provides a single integrated interface to access various tools (including all tools mentioned above).<h2>ABAP Development Tools</h2><ul> <li>Using certain set of plug-in in the <a href='https://en.wikipedia.org/wiki/Eclipse_(software)'>Eclipse platform</a> we can develop ABAP programs in eclipse, these are formally known as 'ABAP in Eclipse' or ABAP Development Tools (ADT).</li> <li>In this scenario, the ABAP developer installs the required tools on his computer and works locally, whereas a continuous synchronization with the backend is performed.</li></ul>",
      "status": "inactive"
    }
  ]
}
